app/views/main/draw.html.erb


	//DM: my ajax is not too good. I'm not sure what the code below is doing.
	$.ajax({
		method: "get",
		url: "/main/get_view",
		data: {
			view_num: view_side_num
		},
		dataType: "json",
		cache: false,
		success: function( response ){
			//$( "div.photo-container" ).deleteAllTags();
			document.getElementById("body_view").src='/assets/'+response["img_name"];
			document.getElementById("view_id").value=response["id"];
			//$( "div.photo-container" ).loadTags();
		}
	});
---
SELECT "views".* FROM "views"