app/controllers/main_controller.rb

SELECT "views".* FROM "views"
---
	def app
		@review = params[:review]
		if @review
			user = User.find(params[:user_id])
			@gender = user.gender
			@test = user.test
			allTags = Tag.order("id").find(:all, :conditions=> 'user_id='+params[:user_id])
			@result_arr =[]
			allTags.each do |tag|
				gId = tag.tag_group
				if @result_arr[gId]==nil
					@result_arr[gId] = []
				end
				t ={}
				t["properties"] = {}
				t["properties"]["prop_annotation"] = tag.annotate
				t["properties"]["prop_severity"] = tag.severity
				t["properties"]["prop_posture"] = tag.posture
				t["view_side"] = tag.view_side

				if HandTag.exists?(:tag_id=>tag.id)