app/controllers/main_controller.rb

SELECT "tags".* FROM "tags" WHERE (view_id==1)
---
	def get_tags
		@tags = Tag.find(:all ,:conditions=>"view_id=="+params[:view_id])

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 6]]
---
	def remove_tags
		Tag.delete(params[:id].to_i)